var vm = new Vue({
    el:"#app",
    data:
        {
            itemsShown:3,
            announcements:[
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
                {
                    title:"اطلاعیه",
                    text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است..."
                },
            ]
        }
});
$("#moreItems").click(function (event) {

    $(this).fadeOut(300,function () {
        $(this).fadeIn();
        vm.itemsShown += 3;
        if(vm.itemsShown>vm.announcements.length)vm.itemsShown=vm.announcements.length;
        // $(".addedNotif").hide().fadeIn(1000);

        //
    });
});
